[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/mosleh-exeter/BEM1025/blob/main/Tutorial03-Tutorial03-Data-Structures-in-Pandas-solution.ipynb)

# Tutorial 03. Data Structures in to Pandas

Content:
- Review of main lecture 
- Practice creating dataframe
- Practice subsetting
- Practice operations on columns

**Q1.**  Create a dataframe that contains the following data, (a) by combining seperate pandas series. (b) by transforming a python dictionary.

| company_name | employees | state | layoffs|
| --- | --- | --- |---|
| Amazon | 613300 | WA |10000 |
| Apple | 132000 | CA |1000 |
| Facebook | 71970 | CA |11000 |
| Tesla | 99000 | TX |500 |

In [3]:
import pandas as pd

In [4]:
company_name=pd.Series(['Amazon','Apple','Facebook','Tesla'])
employees=pd.Series([613300,132000,71970,99000])
states=pd.Series(['WA','CA','CA','TX'])
laid_off=pd.Series([10000,1000,11000,500])

df=pd.DataFrame()
df['company_name']=company_name
df['employees']=employees
df['states']=states
df['laid_off']=laid_off
df

  company_name  employees states  laid_off
0       Amazon     613300     WA     10000
1        Apple     132000     CA      1000
2     Facebook      71970     CA     11000
3        Tesla      99000     TX       500

In [5]:
my_dict={'company_name':['Amazon','Apple','Facebook','Tesla'],
         'employees':[613300,132000,71970,99000],
         'states':['WA','CA','CA','TX'],
         'laid_off':[10000,1000,11000,500]
            }
df=pd.DataFrame(my_dict)
df

  company_name  employees states  laid_off
0       Amazon     613300     WA     10000
1        Apple     132000     CA      1000
2     Facebook      71970     CA     11000
3        Tesla      99000     TX       500

**Q2.** (a) Find companies with more than 10000 employees. 
(b) Find companies in California, 
(c) Find companies that have "Ap" in their names or those that are in Texas

In [6]:
df[df['employees']>10000]

  company_name  employees states  laid_off
0       Amazon     613300     WA     10000
1        Apple     132000     CA      1000
2     Facebook      71970     CA     11000
3        Tesla      99000     TX       500

In [7]:
df[df['states']=='CA']

  company_name  employees states  laid_off
1        Apple     132000     CA      1000
2     Facebook      71970     CA     11000

In [8]:
df[(df['company_name'].str.contains('Ap')) | (df['states']=='TX') ]

  company_name  employees states  laid_off
1        Apple     132000     CA      1000
3        Tesla      99000     TX       500

**Q3.** Find average number of employees for companies in California

In [9]:
df[df['states']=='CA']['employees'].mean()

101985.0

**Q4.** For companies in California, find average value of fraction of employees who were laid off

In [12]:
df_CA=df[df['states']=='CA']
df_CA

  company_name  employees states  laid_off
1        Apple     132000     CA      1000
2     Facebook      71970     CA     11000

In [13]:
(df_CA['laid_off']/df_CA['employees']).mean()

0.08020860964795937